[
    [
        "Strategy and Consulting-Senior Manager-Topic Advisory-M&A-Talent and Organization Design expert - 06",
        "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>About Accenture:<br/><br/></strong>Accenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries,we offer Strategy and Consulting,Technology and Operations Services, and Accenture Song - all powered by the worlds largest network of Advanced Technology and Intelligent Operations centers. Our 699,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com<br/><br/>S&amp;C Global Network – M&amp;A Topic Advisory – T&amp;O Expert<br/><br/><br/><strong>Job Description<br/><br/><br/></strong>Responsibilities: Deal origination, proposal development, content management<br/><br/>Skill required: Expertise in Talent &amp; Organization<br/><br/>Designation: M&amp;A Topic Advisory Senior Manager (T&amp;O Expert)<br/><br/>Job Location: Remote<br/><br/>Qualifications: Master’s degree or above<br/><br/>Years of Experience: Minimum of 10 years’ experience in talent and organization topics<br/><br/><strong>About S&amp;C Global Network<br/><br/></strong>Global network of over 9,000 strategy and management consulting specialists connecting across industries and functions to support clients and partners from business development through sales to delivery. Specialty areas entail Strategy, CFO &amp; Enterprise Value, Technology Strategy &amp; Advisory, Talent &amp; Organization, Supply Chain &amp; Operations, Industry X, AI, and Song.<br/><br/>What would you do?<br/><br/>Within S&amp;C Global Network, the global M&amp;A Topic Advisory team is an extension of our global M&amp;A practice, working with practitioners (senior managers and above), functional / industry subject matter experts, and client account leadership to help client teams to originate deals, develop conversation starters, proposals, discussion documents and preliminary analyses, and craft tailored proposals.<br/><br/>The M&amp;A Topic Advisor will typically develop proposals around the notions of value creation for the corporate and financial investors, in line with Accenture’s dedicated end-to-end offerings:<br/><br/>– Due diligence and pre-deal support (e.g., market assessment, target screening, due diligence)<br/><br/>– Merger integration (e.g., day 1 execution, post-close support, end-state transition, value capture)<br/><br/>– Carve-out and divestiture (e.g., day 1 execution, set-up of standalone entity, TSA management, stranded cost management)<br/><br/>– Corporate strategy (e.g., operating model / digital transformation, re-platforming, capability scaling, growth strategy)<br/><br/>– M&amp;A capability development (e.g., capability maturity, new capability design)<br/><br/>The M&amp;A Topic Advisory Senior Manager (T&amp;O Expert) acts as an extension of the client team, writing content for all or parts of the proposal depending on the complexity of the opportunity. They provide a single point of contact for internal clients globally, building and managing stakeholder relationships and developing trusted partnerships.<br/><br/>What are we looking for?<br/><br/><li> Expertise in Talent &amp; Organization topics, e.g., organization design, change management and employee experience, culture integration, talent retention / management processes, workplace transformation</li><li> 10-year experience delivering on people integration, organization transformation and change management programs</li><li> Structured thinking with a quantitative mindset</li><li> Understanding of the M&amp;A deal lifecycle, both pre- and post-deal</li><li> Proven relationship management skills at all levels and ability to lead in a professional setting</li><li> Collaborative attitude for working and interacting with deal teams effectively in a virtual environment</li><li> Confidence working under time pressure and in fast-paced environments</li><li> Experience in proposal development and writing</li><li> English language fluency (oral and written)</li><li> Executive oral and written communication skills (clarity, consistency, conciseness)</li><li> Proficient use of PowerPoint<br/><br/></li>Role and Responsibilities<br/><br/><li> Builds relationships with the M&amp;A practice leadership, ideally serving as the first call deal teams make when they need sales support</li><li> Creates winning proposals for M&amp;A clients, in some cases from end to end, using practitioners across Accenture, industry and functional subject matter experts, and other teams as needed</li><li> Works with the M&amp;A practice leadership to support deal origination (e.g., sales pitches, initial client conversations, positioning papers, and other origination efforts)</li><li> Reviews content for consistency and quality prior to delivery to the deal team</li><li> Collaborates with deal teams through proposal storyboarding sessions and aligns content and messaging for conversation starters, proposals, oral presentations, and other materials</li><li> Helps to build and maintain sales assets (e.g., stage-0 decks, capability overviews, playbooks)</li><li> Harvests content collaboratively to help Accenture’s global knowledge/content management teams maintain a repository of the latest sales and delivery assets (e.g., credentials, proposals, deliverables, and resumes)</li><li> Coordinates work with other supporting teams (e.g., graphics designers, research analysts) to provide a single point of contact for internal clients</li><li> Connects with internal organizations (e.g., Offering Development, Knowledge Management, Pricing) to drive efficiency across client pursuit support and sales materials development</li><li> Provides regular and open feedback to colleagues and is an active contributor in talent discussions and talent decisions as needed</li>\n</div>",
        "https://www.accenture.com/in-en/careers/jobdetails?src=LINKEDINJP&id=91939_india_4",
        289630,
        "Bengaluru, Karnataka, India",
        "management consulting,communication,change management,leadership,knowledge management,due diligence,digital transformation,communication skills,market assessment,strategy",
        [
            10,
            "12"
        ],
        "16"
    ],
    [
        "C.I. Consultant - Therapeutic Area: Respiratory",
        "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        Competitive Intelligence Consultant – Respiratory (Remote)<br/><br/>Atacana Group, Inc. is a global competitive strategy and intelligence firm focused on the healthcare industry. Our experienced pharma executives advise leading organizations in developing strategies to accelerate value creation and innovation. Clients partner with us when they have to make business-critical decisions and investments such as acquiring new assets, creating and executing development and launch plans, or for maximizing market penetration.<br/><br/>Why join our fast-growing team?<br/><br/><ul><li> Passion for innovation. We are passionate about supporting the advancement of innovations in healthcare and innovating the way we work. </li><li> A culture of results, not hours spent.Flexible hours let us schedule our days so that we do our best work without missing out on lifes important moments. </li><li> Freedom of location.100% remote work. We are a globally distributed team, so we can work wherever were happiest. </li><li> Diverse and global team. Our team members are located across 4 continents and are located in 11+ countries. </li><li> Growth mindset.Atacana is a hyper growth organization that has doubled in size year over year with no intentions of slowing down. <br/><br/></li></ul><strong>Purpose Of The Role<br/><br/></strong><ul><li> Provide objective and timely Competitive Intelligence for clients’ marketed products and pipeline assets</li><li> Proactively and continuously monitor our clients competitive landscape using various resources (e.g. news/updates, press releases, investor events, regional clinical trial and regulatory databases) and proprietary databases (such as Alphasense, Pharmatell, Citeline)</li><li> Translate competitive findings into insights and recommendations for our clients</li><li> Required travel: Attend approximately 6 medical conferences. Understand the conference coverage objectives, write-up session summaries and create a post conference report for clients</li><li> Deep Dive secondary research utilizing various data sources and databases as above</li><li> Solid understanding of commercial, regulatory and clinical domains to best support client needs</li><li> Develop CI news alerts with analysis and insights for key competitor updates<br/><br/></li></ul><strong>Minimum Requirements<br/><br/></strong><ul><li> Master’s Degree</li><li> 8-10 years of experience</li><li> A background in consulting and someone who is established in the Competitive Intelligence field</li><li> Should possess understanding of early clinical datal &amp; pipeline space, with the ability to scan for new assets that clients may or may not purchase</li><li> Ability to work independently with experience in meeting end-to-end deliverables</li><li> A proven track record of success &amp; exceeding expectations, e.g. winning awards or promotions. </li><li> Secondary Monitoring</li></ul><ul><li></li><ul><li>Experience setting up alerts, secondary research &amp; desktop research utilizing all available sources in the public domain, preparing deliverables</li><li> Primary CI</li></ul></ul> <br/><br/><ul><li></li><ul><li>Knowledgeable on how CI is collected and package it into final deliverables w/ability to visualize information in a creative way, e.g. attractive slides w/frameworks, visual tools &amp; storytelling; experience creating final reports</li><li> While the Indication Area is flexible, there is a preference for experience in the Respiratory areas such as:</li></ul></ul> <br/><br/><ul><li></li><ul><li>COPD</li><li>Asthma</li><li>Pulmonary hypertension</li><li>Potentially, vaccines<br/></li></ul></ul><strong>Desired Skills<br/><br/></strong><ul><li>Strong knowledge of the respiratory therapeutic area is strongly preferred but not required</li><li>Experience using the following databases/websites – Citeline, Pharmatell, Alphasense. Clinical trial registries (US, EU, Canada, etc.), Regulatory websites (FDA, EMA, Health Canada, etc.)<br/><br/></li></ul><strong>Soft Skills<br/><br/></strong><ul><li> A solid communicator who is articulate in English, both written and spoken</li><li> Someone who confident to speak up speaks up and assert themselves</li><li> A self-started with a proactive, ownership mindset who works in an agile way</li><li> Capability of adapting to changes and shifting priorities</li></ul>\n</div>",
        "https://atacana.bamboohr.com/careers/60",
        290900,
        "India",
        "innovation,competitive intelligence,competitive strategy,strategy",
        [
            8,
            10
        ],
        "16"
    ],
    [
        "Snowflake Consultant",
        "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        Spaulding Ridge is an advisory and IT implementation firm. We help global organizations get financial clarity into the complex, daily sales, and operational decisions that impact profitable revenue generations, efficient operational performance, and reliable financial management.<br/><br/>At Spaulding Ridge, we believe all business is personal. Core to our values is our relationships with our clients, our business partners, our team, and the global community. Our employees dedicate their time to helping our clients transform their business, from strategy through implementation and business transformation.<br/><br/><strong>What You Will Do And Learn<br/><br/></strong>As a Snowflake Consultant in Data Solutions, you’ll be responsible for pre-sales, estimation, scoping, designing, implementing, and testing proposed modern analytic solutions. Working closely with our client partners, you’ll develop relationships with key technical resources while delivering tangible business outcomes.<br/><br/><ul><li>Manage the Data engineering lifecycle including research, proof of concepts, architecture, design, development, test, deployment, and maintenance</li><li>Collaborate with team members to design and implement technology that aligns with client business objectives</li><li>Build proof of concepts for a modern analytics stack supporting a variety of Cloud-based Business Systems for potential clients</li><li>Team management experience and ability to manage, mentor and develop talent of assigned junior resources</li><li>Create actionable recommendations based on identified platform, structural and/or logic problems</li><li>Communicate and demonstrate a clear understanding of client business needs, goals, and objectives</li><li>Collaborate with other practices on Solution Plays, Pre-Sales Activities, Estimation, Scoping and Solutions<br/><br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>4+ years’ experience developing industry leading business intelligence and analytic solutions.</li><li>2+ years experience developing in Snowflake</li><li>Should have completed SnowPro Core certification</li><li>Experience working in DBT, AWS, Azure, GCP or similar cloud data platform would be an added advantage</li><li>Experience working with analytic technologies such as Tableau, DataIku, PowerBI, ThoughtSpot, Qlik, Looker and other similar analytic tools would be an added advantage</li><li>3+ years of Business Data Analyst experience</li><li>3+ years of experience writing Business requirements, Use cases and/or user stories, preferably for data warehouse or data mart initiatives.</li><li>3+ years of hand-on experience with data analysis / profiling</li><li>3+ years of SQL development including advanced analytic functions</li><li>3+ years of consulting experience working on project-based delivery using Software Development Life Cycle (SDLC)</li><li>2+ years of years of experience with relational databases (Postgres, MySQL, SQL Server, Oracle, Teradata etc.)</li><li>2+ years of experience creating functional test cases and supporting user acceptance testing</li><li>2+ years of experience in Agile/Kanban/DevOps Delivery</li><li>Outstanding analytical, communication, and interpersonal skills</li><li>Ability to manage projects and teams against planned work</li><li>Responsible for managing the day-to-day client relationship on projects</li><li>Ability to support sales cycles by leading orals sessions along with building POC solutions for clients.<br/><br/><br/></li></ul><strong>What Else To Expect<br/><br/></strong>As a Spaulding Ridge employee, the right candidate will also gain exposure to an early-stage growth company providing innovative opportunities to impact our clients in a meaningful way. We believe giving back is core to our values. As such, the opportunity to participate in SR’s day of service, giving back to the global community.<br/><br/>We take care of you!<br/><br/>Here are some our great perks and top benefits to highlight:<br/><br/><ul><li>Full benefit offerings including health, wellness, retirement and lifestyle offerings</li><li>Paid holiday time</li><li>Flexible Time Off – Take the time you need when you need to take it</li><li>Paid maternity and paternity leave<br/><br/><br/></li></ul><strong>Spaulding Ridge’s Diversity, Equity &amp; Inclusion (DEI) Commitment<br/><br/></strong>When we engage the expertise, insights, and creativity of people from all walks of life, we become a better organization, we deliver superior services to clients, and we transform our communities and world for the better.<br/><br/>At Spaulding Ridge, we believe our team should reflect the rich diversity of society and we take seriously the responsibility to cultivate a workplace where every bandmate feels accepted, respected, and valued for who they are. We do this by creating a culture of trust and belonging, through practices and policies that support DEI, and through our employee led Employee Resource Groups (ERGs): CRE (Cultural Race and Ethnicity), Women Elevate, PROUD and Mental Wellness Alliance.<br/><br/>The company is committed to offering Equal Employment Opportunity and to providing reasonable accommodation to applicants with physical and/or mental disabilities. If you are interested in applying for employment with Spaulding Ridge and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to our VP of Human Resources, Cara Halladay ( challaday@spauldingridge.com ). Requests for reasonable accommodation will be considered on a case-by-case basis.<br/><br/>Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.\n      </div>",
        "https://boards.greenhouse.io/spauldingridge/jobs/4945888004?source=LinkedIn",
        290759,
        "Jaipur, Rajasthan, India",
        "communication,data analysis,creativity,business intelligence,business transformation,financial management,strategy",
        [
            5,
            10
        ],
        "16"
    ],
    [
        "Senior SSIS Consultant",
        "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong><strong>About Us<br/><br/></strong></strong><strong>Thoucentric is the Consulting arm of Xoriant</strong>, a prominent digital engineering services company with 5000+ employees. We are headquartered in Bangalore with presence across multiple locations in India, US, UK, Singapore &amp; Australia Globally.<br/><br/>As the Consulting business of <strong>Xoriant</strong>, We help clients with Business Consulting, Program &amp; Project Management, Digital Transformation, Product Management, Process &amp; Technology Solutioning and Execution including Analytics &amp; Emerging Tech areas cutting across functional areas such as Supply Chain, Finance &amp; HR, Sales &amp; Distribution across US, UK, Singapore and Australia. Our unique consulting framework allows us to focus on execution rather than pure advisory. We are working closely with marquee names in the global consumer &amp; packaged goods (CPG) industry, new age tech and start-up ecosystem. Xoriant (Parent entity) started in 1990 and is a Sunnyvale, CA headquartered digital engineering firm with offices in the USA, Europe, and Asia. Xoriant is backed by ChrysCapital, a leading private equity firm. Our strengths are now combined with Xoriant’s capabilities in AI &amp; Data, cloud, security and operations services proven for 30 years.<br/><br/>We have been certified as \"<strong>Great Place to Work\"</strong> by AIM and have been ranked as \"50 Best Firms for Data Scientists to Work For\".<br/><br/>We have an experienced consulting team of over 450+ world-class business and technology consultants based across six global locations, supporting clients through their expert insights, entrepreneurial approach and focus on delivery excellence. We have also built point solutions and products through Thoucentric labs using AI/ML in the supply chain space.<br/><br/><strong><strong>Job Description<br/><br/></strong></strong><strong> At Thoucentric, we work on various problem statements. <br/><br/></strong><ul><li> The most popular ones are - </li><ul><li> Building capabilities that address a market need, basis our ongoing research efforts </li><li> Solving a specific use case for a current or potential client based on challenges on-ground </li><li> Developing new systems that help be a better employer and a better partner to clients </li></ul><li> All of these need the best of minds to work on them day-to-day; and we do exactly that! </li><li> Your contribution to organization development is as important as outward facing consulting. </li><li> We are invested in both, employee growth and client success! <br/></li></ul><strong><strong>Job Description:<br/><br/></strong></strong><ul><li> Build data crawlers to extract data from customers data sources using available ETL platforms, and troubleshoot the issues faced during data loading &amp; processing </li><li> Design and build data warehouse models in columnar databases </li><li> Develop data processing scripts using SQL and be able to optimize complex sequences of SQL Queries </li><li> Design, build and deploy effective SSIS packages to validate, synthesize, transform customer data for integrated business planning and analytics </li><li> Work with Solution Architects to understand customers business requirements and implement them </li><li> Perform data analysis for complex use cases using SQL document technical specification for </li><li> the cognitive applications that we are creating for the customers </li><li> Own the entire development and implementation workflow </li><li> Participate in the technical design, data requirements gathering and making recommendations on best practices, in case of inaccurate or missing data </li><li> Design and automate the data loading and insights generation process with intelligent checks and balances for sustained value delivery </li><li> Create and execute test plans, document issues and track progress at resolving issues. <br/><br/></li></ul><strong><strong>Requirements<br/><br/></strong></strong><strong>Must Have:<br/><br/></strong><ul><li>Very strong hands-on experience working in ETL (Extract/Transform/Load) processes</li><li>Proficiency in databases (SQL Server, MySQL) and skills in one or more languages like SQL, MDX, T-SQL with knowledge of DDL, DML, stored procedures, triggers and performance tuning is a MUST</li><li>Basic Unix knowledge</li><li>Exposure to at least one Data Visualization tool – Tableau/Qlik etc</li><li>Familiarity with workflows in programming concepts</li><li>Experience using columnar databases</li><li>Experience working directly with customers and presenting your ideas</li><li>Excellent communication and presentation skills<br/><br/></li></ul><strong><strong>Good To Have:<br/><br/></strong></strong><ul><li>Applied Python programming</li><li>Experience working with JSON and XML files</li><li>Experience using APIs</li><li>Knowledge of SAP</li><li>Knowledge of supply chain fundamentals and terminology<br/><br/></li></ul><strong><strong>Benefits<br/><br/></strong></strong><strong> What a Consulting role at Thoucentric will offer you? <br/><br/></strong><ul><li> Opportunity to define your career path and not as enforced by a manager </li><li> A great consulting environment with a chance to work with Fortune 500 companies and startups alike. </li><li> A dynamic but relaxed and supportive working environment that encourages personal development. </li><li> Be part of One Extended Family. We bond beyond work - sports, get-togethers, common interests etc. Work in a very enriching environment with Open Culture, Flat Organization and Excellent Peer Group. </li><li> Be part of the exciting Growth Story of Thoucentric! <br/><br/></li></ul><strong>{{getI18n(\"crm.setup.careersite.aboutcompany\")}}<br/><br/></strong>{{unescape(removeUnwantedCss(org_info.description))}} {{org_info.description}}<br/><br/><strong>{{each_field.field_label}}<br/><br/></strong>{{unescape(removeUnwantedCss(record[each_field.api_name],true))}} {{getValue(record[each_field.api_name],each_field.data_type)}}<br/><br/><strong>{{getI18n(\"zr.crm.migration.client.attachment.label\")}}</strong> <br/><br/><ul><li></li><ul><li> {{getAttachDotVal(each_attachment.File_Name,28)}} {{each_attachment.File_Name}} </li><li> {{getI18n(\"crm.label.view\")}} </li><li> {{getI18n(\"crm.view.attachment.download\")}}</li></ul></ul>\n</div>",
        "https://thoucentric.zohorecruit.in/jobs/Careers/52951000013479883/Senior-SSIS-Consultant?source=CareerSite",
        289811,
        "Bengaluru, Karnataka, India",
        "communication,project management,data analysis,data visualization,business planning,digital transformation",
        [
            5,
            10
        ],
        "16"
    ]
]